{
  "lockWorld": "<label><h3>This world is locked.</h3><br>Finish the previous chapter to unlock this one.<label>",
  "credit": "<label><span class='bold surligne title'>Credits</span><br/><span class='bold'>Creative director:</span> Serge Versillé (Tralalere)<br/><span class='bold'>Program director:</span> Serge Versillé<br/><span class='bold'>Producers:</span> Vivien Chazel (Tralalere), Anne-Laure Depré (Tralalere)<br/><span class='bold'>Functional design:</span> Vivien Chazel, Serge Versillé<br/><span class='bold'>Code learning design:</span> Serge Versillé (Tralalere), Pierre Lancien (Toxicode)<br/><span class='bold'>Sound Design:</span> Antoine Boucherikha (Life Pass Filter), Walter Geny (Pyramide Studio)<br/><span class='bold'>Art direction:</span> Loguy<br/><span class='bold'>UX design & Graphic design:</span> Eddy Benslimène (Tralalere), Sarah Hévin (Tralalere) under the supervision of Amandine Audras (Tralalere)<br/><span class='bold'>Editors:</span> Serge Versillé, Anne-Laure Depré<br/><span class='bold'>Development:</span> Pierre Machkovsky (Toxicode), Pierre Lancien (Toxicode),<br/>Amine Labassi (ALCS), Nassim El Mansouri (Tralalere),<br/>Sylvie Tissot (Tralalere)<br/><img src='assets/partenaires-en.png'></label>",
  "mentions": "<label><span class='bold surligne title'>Legal</span><br/><br/><span class='bold surligne'>* Publishers :</span> TRALALERE  - www.tralalere.com - Chemin de Pinaquy 64990 Urcuit (France)  / 4 rue de Braque 75003 Paris - 01.49.29.45.25<br/><br/><span class='bold'>Credits</span><br/><span class='bold'>Creative director:</span> Serge Versillé (Tralalere)<br/><span class='bold'>Program director:</span> Serge Versillé<br/><span class='bold'>Producers:</span> Vivien Chazel (Tralalere), Anne-Laure Depré (Tralalere)<br/><span class='bold'>Functional design:</span> Vivien Chazel, Serge Versillé<br/><span class='bold'>Code learning design:</span> Serge Versillé (Tralalere), Pierre Lancien (Toxicode)<br/><span class='bold'>Sound Design:</span> Antoine Boucherikha (Life Pass Filter), Walter Geny (Pyramide Studio)<br/><span class='bold'>Art direction:</span> Loguy<br/><span class='bold'>UX design & Graphic design:</span> Eddy Benslimène (Tralalere), Sarah Hévin (Tralalere) under the supervision of Amandine Audras (Tralalere)<br/><span class='bold'>Editors:</span> Serge Versillé, Anne-Laure Depré<br/><span class='bold'>Development:</span> Pierre Machkovsky (Toxicode), Pierre Lancien (Toxicode),<br/>Amine Labassi (ALCS), Nassim El Mansouri (Tralalere),<br/>Sylvie Tissot (Tralalere)<br/><br/><span class='bold surligne'>Hébergement</span><br/><br/><span class='bold surligne'>* Prestataire d'hébergement :</span> CELESTE Cité Descartes 20 rue Albert Einstein 77 420 Champs-sur-Marne, France Marne-La-Vallée<br/>Siège social : 2 rue Kellermann 59100 Roubaix - France.<br/>Responsabilité La responsabilité de Tralalere ne saurait être engagée pour tous les inconvénients ou dommages inhérents à l'utilisation du réseau Internet, notamment une rupture du service, une intrusion extérieure ou la présence de virus informatiques, ou de tout fait qualifié de force majeure, conformément à la jurisprudence. Toutes les utilisations autres que la consultation individuelle et privée des œuvres présentées sont interdites. La <i>société</i> Tralalere s'efforce de tenir à jour les informations du site sans pour autant avoir une quelconque obligation de résultat. Sa responsabilité n'est pas engagée sur ce point. Loi informatique et libertés, confidentialité La protection de la vie privée est pour nous un point important dans la mise en œuvre de nos divers services internet. A ce titre, nous nous conformons strictement à la loi française, avec en particulierdéclaration de notre fichier à la CNIL (n° XXXX). Le site Tralelere.com collecte certaines informations personnelles uniquement lorsque vous en êtes préalablement averti. De plus, aucune information confidentielle d'identification ne sera mise à la disposition de personnes extérieures à Tralalere.com sans votre autorisation. Conformément à la Loi du 6 janvier 1978 relative à l'informatique, aux fichiers et aux libertés, vous disposez d'un droit d'accès et de rectification aux données personnelles vous concernant. Service auprès duquel s'exerce le droit d'accès : TRALALERE, 4, rue de Braque 75003 Paris, France (contact@tralalere.com).<br/><span class='bold surligne'>Gestion antispam :</span> Mollom Aide et environnement technique<br/><span class='bold surligne'>* Affichage :</span> Ce site a été conçu pour un écran permettant l'affichage d'une page web de largeur 1000 pixels. Il est prévu pour les principaux navigateurs Google Chrome et Mozilla Firefox.<br/><span class='bold surligne'>* Données statistiques :</span> traçabilité et profilage : Lors de leur navigation sur le site, les internautes laissent des traces informatiques. Cet ensemble d'informations est recueilli à l'aide d'un témoin de connexion appelé cookie qui ne contient, toutefois, aucune information personnelle. Dans le but d'améliorer l'ergonomie, la navigation au sein du site, le contenu éditorial et le service aux internautes, l'outil gestionnaire des statistiques du site www.tralalere.com peut stocker des informations relatives au profil des internautes : équipement, navigateur utilisé, origine géographique des requêtes, date et heure de la connexion, navigation sur le site, fréquence des visites, etc. Ces données de connexion permettent des extractions statistiques et sont conservées pendant un an. Tout internaute a la possibilité de refuser l'enregistrement de ces données en modifiant la configuration du navigateur de son ordinateur qui autorise ou non l'enregistrement de cookies. Il vous est possible de les refuser ou de les supprimer sans que cela ait une quelconque influence sur votre accès aux pages du site. Pour vous opposer à l'enregistrement de cookies ou être prévenu avant d'accepter les cookies, nous vous recommandons la lecture de la rubrique d'aide de votre navigateur qui vous précisera la marche à suivre. Cliquez ici pour vous opposer aux cookies de mesure d'audience de Google <br/><span class='bold surligne'>* Technologie du site :</span> Ce site web est motorisé par le CMS Drupal.<br/>Plus d'informations sur : http://drupalfr.org/ Tralalere fait appel au serveur web Apache, à des applications php/mysql, et à des contenus flash. Le site contient des animations multimédias au format Flash. Pour visualiser ce format, il faut disposer d'un logiciel gratuit (Flash Player) que l'on télécharge sur le site internet d'Adobe France à cette adresse : http://www.adobe.com/fr/products/flashplayer/ Propriété intellectuelle<br/><span class='bold surligne'>* Droits d'auteur et de reproduction :</span> Conformément aux dispositions de l'article L. 122-4 du Code de la Propriété Intellectuelle, toute reproduction intégrale ou partielle faite sans le consentement de l'éditeur de ce site est illicite sauf autorisation préalable de ce dernier. Pour toute demande, écrire à contact@tralalere.com. L'ensemble des contenus, pages, scripts, et icônes de ce site Web sont la propriété exclusive de TRALALERE SA. Tous droits de reproduction ou de représentation de ceux-ci sont réservés pour tous pays. Les logos et marques cités dans le site Web de Tralalere sont la propriété respective de leurs auteurs. Cliquez ici pour vous opposer aux cookies de mesure d'audience de Google.<br/><br/>© Tralalere 2017. Tous droits réservés. <label>",
  "foire_aux_questions": "<label><span class='bold surligne title'>About</span><br/><br/><span class='bold'>How do I access Code DJ?</span><br/>If you are accessing Code DJ using a web browser, please use Chrome (version 59+), Firefox (version 54+), Safari (version 10+).<br/>On tablets, you can download for free the Code DJ app on the Apple App Store and the Google Play Store.<br/><br/><span class='bold'>What is it for?</span><br/>Code DJ is a <span class='bold'>code learning application</span>, where players learn coding through <span class='bold'>musical creation</span>.<br/>In Code DJ, the player explores coding concepts that can be learned progressively and without formal teaching. We believe in an approach of learning by doing, through discovery and experimentation.<br/><br/><span class='bold'>What is the objective?</span><br/>Designed for intuitive use and ease of learning, Code DJ tries to offer an<span class='bold'> original approach for code learning</span>. Through its gamified and artistic experience, Code DJ hopes to foster curiosity equally in men and women. No previous knowledge of code or music is necessary to use Code DJ: reading and counting are enough to get started.<br/>When a mistake is made in a level, the game gives player a solution that allows them to understand how a new bit of code might work.<br/><br/><span class='bold'>Who is it for?</span><br/>Tennagers and young adults, or just about anyone who enjoys music and wants to learn code.<br/>It can be used at home, or in classes and workshops.<br/>No previous knowledge of coding or music required.<br/><br/><span class='bold'>How does it work?</span><br/>Players discover different worlds as they progress through the app. Players manipulate programming concepts, which are as simple as adding and subtracting at first, and then complexify as the mastery of each player increases.<br/><br/>In the <span class='bold'>World of Samples</span>, players immersed in a sort of electro hip-hop bolero. As they answer questions, they unlock more and more samples, and build up a whole melody.<br/>By the end of this first World, players can enjoy having put together a complex musical track.<br/><br/>In the <span class='bold'>World of Rhythms</span>, players go through levels where rhythms are a bit out of whack. They can see what the rhythms should be like and can modifiy bits of code to restore the right rhythms. Coding concepts covered start with variables, and then go on to loops, conditions, and functions.<br/>When players finish this second world, they are ready to go and create musical tracks freely in the next world.<br/><br/>In the<span class='bold'> World of Tracks</span>, players can create new musical tracks freely, and then export and share them. In this process, they also export the associated code that will allow other players to remix these creations.<label>",

  "button":{
    "previous": "Back",
    "next": "Next",
    "begin": "Start",
    "play": "Play",
    "titleWorld-samples" : "Samples",
    "titleWorld-rhytmes" : "Beats",
    "titleWorld-morceaux" : "Tracks",

    "creditText": "CREDITS",
    "mentionText": " LEGAL ",
    "faqText": " ABOUT ",
    "sourcesGitHub": " Sources ",
    "privatePolicy": " Privacy policy ",

    "publish": "Publish",
    "solution": "Solution"

  },
  "woldWinBeats":"<div><span>Congratulations!</span><br>You've unlocked the <span class='worldUnlocked'>World of Beats!</span></div>",
  "woldWinTracks":"<div><span>Congratulations!</span><br>You've unlocked the <span class='worldUnlocked'>World of Tracks!</span></div>",

  "missionCompleted":"Full Track!",
  "levelWon":"<div>New melody!</div>",

  "partenaires": "<img src='assets/partenaires-en.png'>",

  "finishedHour": "I’m finished with my Hour of Code",
  "getCertificate": "Get my certificate",

  "dlStore":"<a href='https://itunes.apple.com/fr/app/code-dj/id1317337791?mt=8' target='_blank' class='dl-ios dl-ios-en'></a><a href='https://play.google.com/store/apps/details?id=com.tralalere.codedj' target='_blank' class='dl-android dl-android-en'></a>",

  "goToStore": "<label> Sorry, this track cannot be used with the web version of Code DJ.<br/> It contains samples that are only accessible on the tablet version of Code DJ.<br/>You can download it for free on the <a href='https://itunes.apple.com/fr/app/code-dj/id1317337791?mt=8' target='_blank'>Apple Appstore </a> or on <a href='https://play.google.com/store/apps/details?id=com.tralalere.codedj' target='_blank'>Google Play.</a><label>"
}
