{
  "lockWorld": "<h3>Ce monde est bloqué.</h3><br><label> Pour y accéder, termine d'abord le monde que tu as commencé.<label>",
  "credit": "<label><span class='bold surligne title'>Crédits</span><br/><span class='bold'>Direction créative :</span> Serge Versillé (Tralalere)<br/><span class='bold'>Direction de programme :</span> Serge Versillé (Tralalere)<br/><span class='bold'>Gestion de projet :</span> Vivien Chazel (Tralalere), Anne-Laure Depré (Tralalere)<br/><span class='bold'>Conception fonctionnelle :</span> Vivien Chazel, Serge Versillé (Tralalere)<br/><span class='bold'>Pédagogie et apprentissage du code :</span> Serge Versillé (Tralalere), Pierre Lancien (Toxicode)<br/><span class='bold'>Sound Design :</span> Antoine Boucherikha (Life Pass Filter), Walter Geny (Pyramide Studio)<br/><span class='bold'>Direction Artistique :</span> Loguy<br/><span class='bold'>UX Design & Design graphique :</span> Eddy Benslimène (Tralalere), Sarah Hévin (Tralalere) sous la direction d'Amandine Audras (Tralalere)<br/><span class='bold'>Edito :</span> Serge Versillé, Anne-Laure Depré<br/><span class='bold'>Développement :</span> Pierre Machkovsky (Toxicode), Pierre Lancien (Toxicode), Amine Labassi (ALCS), Nassim El Mansouri (Tralalere), Sylvie Tissot (Tralalere)<br/><img src='assets/partenaires-fr.png'></label>",
  "mentions": "<label><span class='bold surligne title'>Mentions Légales</span><br/><br/><span class='bold surligne'>* Editeurs :</span> TRALALERE  - www.tralalere.com - Chemin de Pinaquy 64990 Urcuit (France)  / 4 rue de Braque 75003 Paris - 01.49.29.45.25<br/><br/><span class='bold'>Crédits</span><br/><<span class='bold'>Direction créative :</span> Serge Versillé (Tralalere)<br/><span class='bold'>Direction de programme :</span> Serge Versillé (Tralalere)<br/><span class='bold'>Gestion de projet :</span> Vivien Chazel (Tralalere), Anne-Laure Depré (Tralalere)<br/><span class='bold'>Conception fonctionnelle :</span> Vivien Chazel, Serge Versillé (Tralalere)<br/><span class='bold'>Pédagogie et apprentissage du code :</span> Serge Versillé (Tralalere), Pierre Lancien (Toxicode)<br/><span class='bold'>Sound Design :</span> Antoine Boucherikha (Life Pass Filter), Walter Geny (Pyramide Studio)<br/><span class='bold'>Direction Artistique :</span> Loguy<br/><span class='bold'>UX Design & Design graphique :</span> Eddy Benslimène (Tralalere), Sarah Hévin (Tralalere) sous la direction d'Amandine Audras (Tralalere)<br/><span class='bold'>Edito :</span> Serge Versillé, Anne-Laure Depré<br/><span class='bold'>Développement :</span> Pierre Machkovsky (Toxicode), Pierre Lancien (Toxicode), Amine Labassi (ALCS), Nassim El Mansouri (Tralalere), Sylvie Tissot (Tralalere)<br/><br/><span class='bold surligne'>Hébergement</span><br/><br/><span class='bold surligne'>* Prestataire d'hébergement :</span> CELESTE Cité Descartes 20 rue Albert Einstein 77 420 Champs-sur-Marne, France Marne-La-Vallée<br/>Siège social : 2 rue Kellermann 59100 Roubaix - France.<br/>Responsabilité La responsabilité de Tralalere ne saurait être engagée pour tous les inconvénients ou dommages inhérents à l'utilisation du réseau Internet, notamment une rupture du service, une intrusion extérieure ou la présence de virus informatiques, ou de tout fait qualifié de force majeure, conformément à la jurisprudence. Toutes les utilisations autres que la consultation individuelle et privée des œuvres présentées sont interdites. La <i>société</i> Tralalere s'efforce de tenir à jour les informations du site sans pour autant avoir une quelconque obligation de résultat. Sa responsabilité n'est pas engagée sur ce point. Loi informatique et libertés, confidentialité La protection de la vie privée est pour nous un point important dans la mise en œuvre de nos divers services internet. A ce titre, nous nous conformons strictement à la loi française, avec en particulierdéclaration de notre fichier à la CNIL (n° XXXX). Le site Tralelere.com collecte certaines informations personnelles uniquement lorsque vous en êtes préalablement averti. De plus, aucune information confidentielle d'identification ne sera mise à la disposition de personnes extérieures à Tralalere.com sans votre autorisation. Conformément à la Loi du 6 janvier 1978 relative à l'informatique, aux fichiers et aux libertés, vous disposez d'un droit d'accès et de rectification aux données personnelles vous concernant. Service auprès duquel s'exerce le droit d'accès : TRALALERE, 4, rue de Braque 75003 Paris, France (contact@tralalere.com).<br/><span class='bold surligne'>Gestion antispam :</span> Mollom Aide et environnement technique<br/><span class='bold surligne'>* Affichage :</span> Ce site a été conçu pour un écran permettant l'affichage d'une page web de largeur 1000 pixels. Il est prévu pour les principaux navigateurs Google Chrome et Mozilla Firefox.<br/><span class='bold surligne'>* Données statistiques :</span> traçabilité et profilage : Lors de leur navigation sur le site, les internautes laissent des traces informatiques. Cet ensemble d'informations est recueilli à l'aide d'un témoin de connexion appelé cookie qui ne contient, toutefois, aucune information personnelle. Dans le but d'améliorer l'ergonomie, la navigation au sein du site, le contenu éditorial et le service aux internautes, l'outil gestionnaire des statistiques du site www.tralalere.com peut stocker des informations relatives au profil des internautes : équipement, navigateur utilisé, origine géographique des requêtes, date et heure de la connexion, navigation sur le site, fréquence des visites, etc. Ces données de connexion permettent des extractions statistiques et sont conservées pendant un an. Tout internaute a la possibilité de refuser l'enregistrement de ces données en modifiant la configuration du navigateur de son ordinateur qui autorise ou non l'enregistrement de cookies. Il vous est possible de les refuser ou de les supprimer sans que cela ait une quelconque influence sur votre accès aux pages du site. Pour vous opposer à l'enregistrement de cookies ou être prévenu avant d'accepter les cookies, nous vous recommandons la lecture de la rubrique d'aide de votre navigateur qui vous précisera la marche à suivre. Cliquez ici pour vous opposer aux cookies de mesure d'audience de Google <br/><span class='bold surligne'>* Technologie du site :</span> Ce site web est motorisé par le CMS Drupal.<br/>Plus d'informations sur : http://drupalfr.org/ Tralalere fait appel au serveur web Apache, à des applications php/mysql, et à des contenus flash. Le site contient des animations multimédias au format Flash. Pour visualiser ce format, il faut disposer d'un logiciel gratuit (Flash Player) que l'on télécharge sur le site internet d'Adobe France à cette adresse : http://www.adobe.com/fr/products/flashplayer/ Propriété intellectuelle<br/><span class='bold surligne'>* Droits d'auteur et de reproduction :</span> Conformément aux dispositions de l'article L. 122-4 du Code de la Propriété Intellectuelle, toute reproduction intégrale ou partielle faite sans le consentement de l'éditeur de ce site est illicite sauf autorisation préalable de ce dernier. Pour toute demande, écrire à contact@tralalere.com. L'ensemble des contenus, pages, scripts, et icônes de ce site Web sont la propriété exclusive de TRALALERE SA. Tous droits de reproduction ou de représentation de ceux-ci sont réservés pour tous pays. Les logos et marques cités dans le site Web de Tralalere sont la propriété respective de leurs auteurs. Cliquez ici pour vous opposer aux cookies de mesure d'audience de Google.<br/><br/>© Tralalere 2017. Tous droits réservés. <label>",
  "foire_aux_questions": "<label><span class='bold surligne title'>A propos</span><br/><br/><span class='bold'>Comment accéder à Code DJ ?</span><br/>Sur internet, Code DJ est optimisé pour les navigateurs Chrome (version 59+), Firefox (version 54+) et Safari (version 10+).<br/>Code DJ est également disponible en application gratuite à télécharger sur l'Apple App Store et sur le Google Play Store.<br/><br/><span class='bold'>Qu'est-ce que Code DJ ?</span><br/>Code DJ est une application d'<span class='bold'>apprentissage du code et de la programmation</span>, où l'on apprend en créant des <span class='bold'>morceaux de musique</span>.<br/>Avec Code DJ, le joueur explore des notions de code qu’il apprend à interpréter petit à petit, dans une posture décomplexée d’apprentissage pratique et actif : découvrir, deviner et apprendre en faisant.<br/><br/><span class='bold'>Quel est l'objectif ?</span><br/>Intuitif dans la manipulation et la compréhension, Code DJ est conçu pour sortir des clichés sur l'apprentissage du code, et offrir une <span class='bold'>manière originale, ludique, et artistique de découvrir des bases de programmation</span> Ce qui pourra intéresser à la fois les filles et les garçons. Aucune connaissance préalable du code ou de la musique n'est nécessaire : il faut simplement savoir lire et compter.<br/>En cas d'erreur sur un niveau, le jeu va donner aux joueurs la solution leur permettant d'analyser leurs erreurs et de comprendre comment un nouveau bout de code marche.<br/><br/><span class='bold'>À qui s'adresse Code DJ ?</span><br/>Ados, jeunes adultes, et quiconque aime la musique et souhaite découvrir la programmation.<br/>En autonomie, en classe, en activité périscolaire.<br/>Pas de connaissances requises en musique ni en programmation<br/><br/><span class='bold'>Comment ça marche ?</span><br/>Le joueur découvre différents mondes à travers sa progression. D’abord très simples, les notions abordées se complexifient petit à petit pour offrir une progression maîtrisée de la difficulté.<br/><br/>Dans le <span class='bold'>Monde des Samples</span>, le joueur vit un boléro musical : il répond à des questions, et chaque bonne réponse vient enrichir d'un sample une mélodie qui se construit.<br/>En fin de ce premier Monde, le joueur a la satisfaction d’avoir créé un morceau complexe.<br/><br/>Dans le <span class='bold'>Monde des Rythmes</span>, les niveaux sont des “ textes à trous ”, où le joueur doit arriver à créer un rythme qui correspond à l’objectif, et valide le niveau en jouant son morceau. Ces niveaux permettent d'aborder des notions plus complexes.<br/>À l'issue de ce second Monde, le joueur débloque le Monde des Morceaux, le mode de création libre.<br/><br/>Dans le <span class='bold'>Monde des Morceaux</span>, le joueur peut créer librement des morceaux de musique, puis les exporter et les partager, avec le code qui permettra à d'autres joueurs de remixer leurs créations.<label>",
  
  "button":{
    "previous": "Retour",
    "next": "Suivant",
    "begin": "Commencer",
    "play": "Jouer",
    "titleWorld-samples" : "Samples",
    "titleWorld-rhytmes" : "Rhytmes",
    "titleWorld-morceaux" : "Morceaux",

    "creditText": "CRÉDITS",
    "mentionText": " MENTIONS ",
    "faqText": " À PROPOS ",
    "sourcesGitHub": " Sources ",

    "publish": "Publier",
    "solution": "Solution"
  },
  "woldWinBeats":"<div><span>Félicitations !</span><br> Vous avez débloqué le <span class='worldUnlocked'>monde des rythmes</span></div>",
  "woldWinTracks":"<div><span>Félicitations !</span><br> Vous avez débloqué le <span class='worldUnlocked'>monde des morceaux</span></div>",

  "missionCompleted":"Morceau complet",
  "levelWon":"<div>Nouveau motif !</div>",

  "partenaires": "<img src='assets/partenaires-fr.png'>",

  "finishedHour": "J'ai terminé mon Heure de Code",
  "getCertificate": "Obtenir mon certificat"

}
